<!DOCTYPE html>
<html>
<head>
    <?php require_once('inc/html-header.inc') ?>
    <title></title>
</head>
<body>
<div class="container">
    <br/>
    <?php $url = [1 => '/', 2 => 'text.php', 3 => 'structure.php', 4 => 'structure-linear.php'] ?>
    <?php $currentStep = 5; require_once('inc/progress.inc') ?>

    <br/>
    <br/>
    <br/>
    <div class="row" style="text-align: center;">
        <div class="col-md-12">
            <p>"Елементи мають (лінійно) слідувати один за одним, важливо показати що це послідовність,
                діаграмма містить широкі або довгі тексти."</p>
            <h3>Ось ваша діаграмма!</h3>
        </div>
    </div>


    <div class="row">
        <div class="col-md-2">
        </div>
        <div class="col-md-8">
            <h1 style="text-align: center;">Лінійна вертикальна послідовність</h1>
            <br/>
            <div style="text-align: center; width: 100%;">
                <img src="img/chart_illustrations/alghoritm.png" style="width: 200px;" />
            </div>
            <h3>Поради:</h3>
            <ol>
                <li>
                    <h4>Зайва інформація</h4>
                    Зробіть діаграмму. Потім подивіться на неї - може є зайва інформація?
                    Якісь елементи які є на схемі але про які ви не збираєьась говорити.
                    зайва інформація має декалька недоліків:
                    - вона займають місце
                    - ви витрачаєте час на те щоб знайти,назвати, розмістити її,
                    - вона обьв’язково викличє питання уважного слухача
                    (людина буде певна що допомагає вам, бо ви нічого не сказали який елемент - забули?)
                </li>
                <li>
                    <h4>Головний елемент</h4>
                    Можливо у вас є один головний елемент, про який ві будете розповідати. Все інше - фон.
                    Виділіть цей елемент кольором. Це з оріентує гладачів,
                    вони не будуть відволікатися на другоряді елементи.
                </li>
                <li>
                    <h4>Конрасний фон</h4>
                    Впевніться що пишете темними літерами по світлому тлу, чи світлими по темному.
                    Не використовуйте фоновій градієнт - якісь літери обов’язково буде не зручно читати.
                </li>
                <li>
                    <h4>Відстань від рамки</h4>
                    Відстань від рамки до тексту має бути більше вісоти заголовної літери (наприклад "М").
                    Не ліпіть текст до рамки, читачам буде важко розгледіти літери -
                    лінія нижньої рамки буде сприйматися як частина літери.
                    Наприклад якшо нижній рядок ліпиться но нижньї рамки, то "П" і "О" бідуть схожі, а також
                    "М-Ш-Щ", "В-Р-Е" т.п.
                </li>
            </ol>
        </div>
        <div class="col-md-2">
        </div>
    </div>
</div>

<br/>
<br/>
<br/>

</body>
</html>
