<!DOCTYPE html>
<html>
<head>
    <?php require_once('inc/html-header.inc') ?>
    <title></title>
</head>
<body>
<div class="container">
    <br/>
    <?php $url = [1 => '/', 2 => 'text.php', 3 => 'structure.php', 4 => 'structure-linear.php'] ?>
    <?php
        $currentStep = 5;
        require_once('inc/progress.inc');
    ?>

    <br/>
    <br/>
    <br/>

    <div class="jumbotron" style="background-color: #fefefe; border: 1px solid #ddd;text-align: center;">
        <h4>"Елементи мають (лінійно) слідувати один за одним, <br/> важливо показати що це послідовність,
            діаграмма містить широкі або довгі тексти."</h4>
        <h2>Лінійна вертикальна послідовність</h2>
        <div style="text-align: center; width: 100%;">
            <img src="img/chart_illustrations/algorithm.png" style="width: 200px;" />
        </div>
    </div>

    <div class="jumbotron col-md-12" style="background-color: #fefefe; border: 1px solid #ddd;text-align: center;">
        <h3>Поради при оформленні діаграмми:</h3>
        <br/>
        <?php
            $advices = [
                [
                    'label' => 'Залиште тільки важливе',
                    'texts' => [
                        'Зробіть діаграмму.',
                        'Потім подивіться на неї - може є зайва інформація?',
                        'Якісь елементи які є на схемі але про які ви не збираєьась говорити.',
                        'зайва інформація має декалька недоліків:',
                        '- вона займають місце',
                        '- ви витрачаєте час на те щоб знайти,назвати, розмістити її,',
                        '- вона обьв’язково викличє питання уважного слухача (людина буде певна що допомагає вам, бо ви нічого не сказали який елемент - забули?)',
                    ]
                ], [
                    'label' => 'Виділіть головний елемент',
                    'texts' => [
                        'Можливо у вас є один головний елемент, про який ві будете розповідати. Все інше - фон.',
                        'Виділіть цей елемент кольором. Це з оріентує гладачів, вони не будуть відволікатися на другоряді елементи.',
                    ]
                ], [
                    'label' => 'Зробіть конрасний (відносно літер) фон',
                    'texts' => [
                        'Впевніться що пишете темними літерами по світлому тлу, чи світлими по темному.',
                        'Не використовуйте фоновій градієнт - якісь літери обов’язково буде не зручно читати.',
                    ]
                ], [
                    'label' => 'Зробіть відстань від рамки до текстів',
                    'texts' => [
                        'Відстань від рамки до тексту має бути більше вісоти заголовної літери (наприклад "М").',
                        'Не ліпіть текст до рамки, читачам буде важко розгледіти літери - лінія нижньої рамки буде сприйматися як частина літери.',
                        'Наприклад якшо нижній рядок ліпиться но нижньї рамки, то "П" і "О" бідуть схожі, а також "М-Ш-Щ", "В-Р-Е" т.п.',
                    ]
                ]
            ];
            require_once('inc/advices.inc');
        ?>
    </div>
</div>

<br/>
<br/>
<br/>

</body>
</html>
